using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


///-------------------------------------------------------------------------------------------------
// namespace: AdapterModel
// 
// summary:	类适配器. 
///-------------------------------------------------------------------------------------------------

namespace AdapterModel
{
   ///-------------------------------------------------------------------------------------------------
   /// <summary>    适配器中的目标角色. </summary>
   ///
   /// <remarks>    Billly, 2017:06:03 23:10:34. </remarks>
   ///-------------------------------------------------------------------------------------------------

   public interface IA7Lidar
    {
        void Request();
    }

    ///-------------------------------------------------------------------------------------------------
    /// <summary>  Ev雷达. </summary>
    ///
    /// <remarks>   Billly, 2017:06:03 23:12:49. </remarks>
    ///-------------------------------------------------------------------------------------------------

    public abstract class EVLidar
    {
        public void SpecificRequest()
        {
            Console.WriteLine("我是EV雷达");
        }
    }

    ///-------------------------------------------------------------------------------------------------
    /// <summary>   适配器接口放在类后面. </summary>
    ///
    /// <remarks>   Billly, 2017:06:03 23:14:07. </remarks>
    ///-------------------------------------------------------------------------------------------------

    public class LidarAdapter : EVLidar, IA7Lidar
    {
        public void Request()
        {
            this.SpecificRequest();
        }
    }

}
